ezois_ka/oooezoiskaobmen/src/InformationRegisters/СведенияРеглОтчетАлкоПрил22Раздел2Возвраты/СведенияРеглОтчетАлкоПрил22Раздел2Возвраты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СведенияРеглОтчетАлкоПрил22Раздел2Возвраты</name>
  <resources>
    <name>П000030000301</name>
    <comment>Вид продукции</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>П000030000302</name>
    <comment>Код вида продукции</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>П000030000303</name>
    <comment>Наименование производителя/импортера</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>П000030000303Адрес</name>
    <comment>Адрес производителя/импортера</comment>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>П000030000304</name>
    <comment>ИНН производителя/импортера</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>П000030000305</name>
    <comment>КПП производителя/импортера</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>П000030000306</name>
    <comment>Наименование организации поставщика</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>П000030000307</name>
    <comment>Адрес поставщика</comment>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>П000030000308</name>
    <comment>ИНН организации поставщика</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>П000030000309</name>
    <comment>КПП организации поставщика</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>П000030000310</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>П000030000311</name>
    <comment>Дата закупки</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>П000030000312</name>
    <comment>Номер ТТН</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>П000030000313</name>
    <comment>Номер ГТД</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>П000030000314</name>
    <comment>Объем закупленной продукции</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ХешИдКодПродПроизв</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХешИдПроизводителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХешИдПоставщика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХешИдЛицензии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводительИмпортер</name>
    <type>
      <types>DefinedType.КонтрагентБРО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументДвижения</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>DefinedType.КонтрагентБРО</types>
    </type>
  </attributes>
  <attributes>
    <name>Активно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>П000030000303АдресXML</name>
    <comment>Адрес XML или JSON производителя/импортера</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>П000030000307XML</name>
    <comment>Адрес XML или JSON поставщика</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерияНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.РегламентированныйОтчет</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИндексСтроки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИДДокИндСтраницы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>47</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ezois_ka/oooezoiskaobmen/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <predefined>
    <items>
      <name>РозничныйПокупатель</name>
      <description>Розничный покупатель</description>
    </items>
  </predefined>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <comment>Реквизит введен для совместимости с Библиотекой типов и не выводится в пользовательский интерфейс. Заполняется автоматически по данным реквизита ЮрФизЛицо.</comment>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаРегистрации</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнойКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>DefinedType.ИНН</types>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <type>
      <types>EnumRef.ЮрФизЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>НДСПоСтавкам4и2</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НалоговыйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеМеждународное</name>
    <comment>Наименование в латинской транскрипции</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеВТранскрипции</name>
    <comment>Наименование в русской транскрипции</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>550</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>ДействуетС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияКПП</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КПП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияНаименований</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СокращенноеНаименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ezois_ka/oooezoiskaobmen/src/InformationRegisters/СведенияРеглОтчетАлкоПрил22Раздел2Возвраты/Forms/ФормаЗаписи/Module.bsl
#Область ОписаниеПеременных

&НаСервере
Перем ОбъектЭтогоОтчета; // Объект метаданных отчета, из которого открыта форма записи.

&НаКлиенте
Перем УправляемаяФормаВладелец; // Форма отчета, из которого открыта форма записи.

&НаКлиенте
Перем УникальностьФормы; // Уникальный идентификатор формы отчета.

&НаКлиенте
Перем ПоказыватьПредупреждениеПослеПереходаПоСсылке; // Флаг необходимости показа предупреждения.

// Форма выбора из списка, ввода пары значений, форма длительной операции, 
// записи регистра, ввода данных по ОП и т.д.
// Любая открытая из данной формы форма в режиме блокировки владельца.
&НаКлиенте
Перем ОткрытаяФормаПотомокСБлокировкойВладельца Экспорт;

&НаКлиенте
Перем АктивноеПоле, ИмяАктивногоПоля;

#КонецОбласти


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	УправлениеВидимостью(Ложь, Ложь);
	
	ЦветСтиляНезаполненныйРеквизит 	= ЦветаСтиля["ЦветНезаполненныйРеквизитБРО"];
	ЦветСтиляЦветГиперссылкиБРО		= ЦветаСтиля["ЦветГиперссылкиБРО"];
	ФормированиеПредставленияПродукцииНаСервере();
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ЦветСтиляНезаполненныйРеквизит 	= ЦветаСтиля["ЦветНезаполненныйРеквизитБРО"];
	ЦветСтиляЦветГиперссылкиБРО		= ЦветаСтиля["ЦветГиперссылкиБРО"];
	
	// Определим тексты запросов динамических списков.
			
	ВставитьКодПродукции = Ложь;
	
	ТекстЗапроса = РегламентированнаяОтчетностьАЛКО.ТекстЗапросаВыбораПроизводителяИмпортераАЛКО(
																	ВставитьКодПродукции);	    
	ДинСписокПроизводителяИмпортера.ТекстЗапроса = ТекстЗапроса;
	ДинСписокПроизводителяИмпортера.ОсновнаяТаблица = "Справочник.Контрагенты";
	ДинСписокПроизводителяИмпортера.ДинамическоеСчитываниеДанных = Истина;
	
	Если ВставитьКодПродукции Тогда
		ДинСписокПроизводителяИмпортера.Параметры.УстановитьЗначениеПараметра("КодПродукции", Запись.П000030000302);
	КонецЕсли;
	
	ВставитьКодПродукцииПоставщик = Ложь;
	ОсновнаяТаблица = "";
	
	ВставитьДату = Истина;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("КодПродукции", Ложь);
	СтруктураПараметров.Вставить("ВставитьКодПродукции", ВставитьКодПродукцииПоставщик);
	СтруктураПараметров.Вставить("ВставитьДату", ВставитьДату);
		
	ТекстЗапроса = РегламентированнаяОтчетностьАЛКО.ТекстЗапросаВыбораКонтрагентаАЛКО(
									ОсновнаяТаблица, Истина, , , СтруктураПараметров);
									
	СтруктураПараметров.Свойство("ВставитьКодПродукции", ВставитьКодПродукцииПоставщик);
			
	ДинСписокПоставщика.ТекстЗапроса = ТекстЗапроса;
	ДинСписокПоставщика.ОсновнаяТаблица = ОсновнаяТаблица;
	ДинСписокПоставщика.ДинамическоеСчитываниеДанных = Истина;
	
	Если ВставитьКодПродукцииПоставщик Тогда	
		ДинСписокПоставщика.Параметры.УстановитьЗначениеПараметра("КодПродукции", Запись.П000030000302);		
	КонецЕсли; 
	
	Если СтрНайти(ТекстЗапроса, "&ДатаКонца") > 0 Тогда
	
		ДинСписокПоставщика.Параметры.УстановитьЗначениеПараметра("ДатаНачала", '1000.01.01 00:00.00');
		ДинСписокПоставщика.Параметры.УстановитьЗначениеПараметра("ДатаКонца", '2099.12.31 23:59.59');
	
	КонецЕсли;
	
	Элементы.ТаблицаПоставщиков.Обновить();
	Элементы.ТаблицаПроизводителей.Обновить();
	
	РегламентированнаяОтчетностьАЛКО.ПодготовкаИнтерфейсаФормыАЛКО(ЭтаФорма);
		
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	ТекстПредупреждения = НСтр("ru='Данная форма предназначена для редактирования данных из форм регламентированных отчетов.
										|
										|Открытие данной формы не из формы регламентированного отчета не предусмотрено!'");
	
	// Ищем управляемую форму отчета, откуда открыли и настраиваем интерфейс по настройкам отчета.
	УправляемаяФормаВладелец = Неопределено;
	РегламентированнаяОтчетностьАЛКОКлиент.ИнициализироватьUIПодчиненнойФормыОтчетаАЛКО(
												ЭтаФорма, УправляемаяФормаВладелец);
	Если УправляемаяФормаВладелец = Неопределено Тогда
		
	    Отказ = Истина;		
		ПоказатьПредупреждение(, ТекстПредупреждения);
		Возврат;
		
	КонецЕсли;
	
	ИмяФормыВладельца 	= УправляемаяФормаВладелец.ИмяФормы;
	УникальностьФормы   = УправляемаяФормаВладелец.УникальностьФормы;
	Оповестить("ОткрытаФормаЗаписиРегистра", ЭтаФорма, УникальностьФормы);
	
	ТекущееСостояниеВладельца = УправляемаяФормаВладелец.ТекущееСостояние;
	
    ДокументЗаписи = 		УправляемаяФормаВладелец.СтруктураРеквизитовФормы.мСохраненныйДок;
	ИндексСтраницыЗаписи = 	УправляемаяФормаВладелец.ИндексАктивнойСтраницыВРегистре;
	ИндексСтраницы = 		УправляемаяФормаВладелец.НомерАктивнойСтраницыМногострочногоРаздела;
	НомерПоследнейЗаписи = 	УправляемаяФормаВладелец.КоличествоСтрок;
	МаксИндексСтраницы = 	УправляемаяФормаВладелец.МаксИндексСтраницы;
	
	ДатаПодписи = 			УправляемаяФормаВладелец.ДатаПодписи;
	
	ПоказыватьПредупреждениеПослеПереходаПоссылке = УправляемаяФормаВладелец.ПоказыватьПредупреждениеПослеПереходаПоссылке;
	
	Если ТекущееСостояниеВладельца = "Добавление" или ТекущееСостояниеВладельца = "Копирование" Тогда
				
		// Заполним измерения, их нет на форме.
	    Запись.Активно = Истина;
		
		Запись.Документ = ДокументЗаписи;
				
		НомерПоследнейЗаписи = НомерПоследнейЗаписи + 1;
	    Запись.ИндексСтроки = НомерПоследнейЗаписи;
		
		Модифицированность = Истина;
		
		// При копировании документ заполнения не копируем,
		// поскольку по факту строка создается вручную, а не в процессе заполнения.
		Запись.ДокументДвижения = Неопределено;
			
	КонецЕсли;
		
	Заголовок = "Возврат алкогольной продукции";
	
	ФлажокОтклАвтоРасчет 	= УправляемаяФормаВладелец.СтруктураРеквизитовФормы.ФлажокОтклАвтоРасчет;
	ФлажокОтклАвтоВыборКодов	= УправляемаяФормаВладелец.СтруктураРеквизитовФормы.мАвтоВыборКодов;
	ДатаПериодаОтчета = УправляемаяФормаВладелец.СтруктураРеквизитовФормы.мДатаКонцаПериодаОтчета;
	ДатаНачалаОтчета = УправляемаяФормаВладелец.СтруктураРеквизитовФормы.мДатаНачалаПериодаОтчета;
	
	ПодготовкаНаСервере();

	Если (ВладелецФормы.ТекущийЭлемент <> Неопределено) 
		и НЕ (ТекущееСостояниеВладельца = "Добавление" или ТекущееСостояниеВладельца = "Копирование")
		Тогда
		
		ИмяАктивногоПоля = ВладелецФормы.ТекущийЭлемент.Имя;
		
		// Если активное поле Наименование продукции - перекинем на код.
		Если ИмяАктивногоПоля = "П000030000301" ИЛИ ИмяАктивногоПоля = "П000030000302" Тогда
		    ИмяАктивногоПоля = "Представление";			
		КонецЕсли; 
		
		Если ИмяАктивногоПоля = "П000030000303Адрес" Тогда
		    ИмяАктивногоПоля = "ПредставлениеАдресаПроизводителя";			
		КонецЕсли;
		
		Если ИмяАктивногоПоля = "П000030000307" Тогда
		    ИмяАктивногоПоля = "ПредставлениеАдресаПоставщика";			
		КонецЕсли;
		
	    АктивноеПоле = Элементы.Найти(ИмяАктивногоПоля);
		Если НЕ АктивноеПоле = Неопределено Тогда
			
			ТекущийЭлемент = АктивноеПоле;
			
			РегламентированнаяОтчетностьАЛКОКлиент.ВыполнитьСЗадержкой(ЭтаФорма, "АктивизироватьПоле", 0.1);
			
		КонецЕсли;
			
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура АктивизироватьПоле() Экспорт

	РегламентированнаяОтчетностьАЛКОКлиент.АктивизироватьПолеФормыРегистраСведений(
				ЭтаФорма, АктивноеПоле, ИмяАктивногоПоля, ТекущееСостояниеВладельца);

КонецПроцедуры

&НаСервере
Функция ПолучитьДействиеПоляФормы(ИмяПоля, ИмяДействия) Экспорт
	Возврат Элементы[ИмяПоля].ПолучитьДействие(ИмяДействия);
КонецФункции

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Оповестить("ЗакрытаФормаЗаписиРегистра", , УникальностьФормы);
	
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
				
	ВнесеныИзменения = Модифицированность;
	
	Если ТекущееСостояниеВладельца = "Добавление" или ТекущееСостояниеВладельца = "Копирование" Тогда
		// Обработка ситуаций "битых" внутренних данных отчета.
		// В норме условие должно проверяться один раз, результат Ложь, 
		// но если из отчета пришло неверное значениепоследней строки - этот цикл позволит
		// записать корректно данные.
		// В дальнейшем при закрытии формы через оповещение отчет будет проинформирован о текущей строке,
		// и скорректирует свои внутренние данные.
		
		СписокСоставаРегистра = Новый СписокЗначений;
		СписокСоставаРегистра.Добавить("Измерения");
		СтруктураИзмерений = РегламентированнаяОтчетностьАЛКО.ПолучитьСтруктуруДанныхЗаписиРегистраСведений(
																		ИмяРегистра, СписокСоставаРегистра);
	
		Пока РегламентированнаяОтчетностьАЛКО.СуществуетЗапись(Запись, ИмяРегистра, СтруктураИзмерений) Цикл
			
			НомерПоследнейЗаписи = НомерПоследнейЗаписи + 1;
			Запись.ИндексСтроки = НомерПоследнейЗаписи;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЭтоПервоеРедактирование = Ложь;
	
	Если ТекущееСостояниеВладельца = "Добавление" или ТекущееСостояниеВладельца = "Копирование" Тогда
		
		РегламентированнаяОтчетностьАЛКО.ДобавитьВРегистрЖурнала(ТекущийОбъект.Документ, ИмяРегистра,
									ИндексСтраницыЗаписи, ТекущийОбъект.ИндексСтроки, "ДобавлениеСтроки");
									
	ИначеЕсли ВнесеныИзменения Тогда
			
		// Нужно записать первоначальные данные Записи регистра в журнал.
		// Но сделать это надо только для случая первого изменения Записи после последнего сохранения отчета,
		// чтобы была информация о данных до изменения в случае отката внесенных изменений, если
		// отказался пользователь от сохранения отчета.
		
		ЭтоПервоеРедактирование = РегламентированнаяОтчетностьАЛКО.ЭтоПервоеРедактированиеЗаписиРегистра(ТекущийОбъект.Документ, ИмяРегистра, 
															ИндексСтраницыЗаписи, ТекущийОбъект.ИндексСтроки);
				
	КонецЕсли;
	
	Если ЭтоПервоеРедактирование Тогда
		
		Ресурсы = Новый Структура;
		Ресурсы.Вставить("НачальноеЗначение", НачальноеЗначение);
		Ресурсы.Вставить("КоличествоСтрок", НомерПоследнейЗаписи);
		Ресурсы.Вставить("МаксИндексСтраницы", МаксИндексСтраницы);
		
		// Нужно сохранить первоначальные данные.
		РегламентированнаяОтчетностьАЛКО.ДобавитьВРегистрЖурнала(ТекущийОбъект.Документ, ИмяРегистра,
									ИндексСтраницыЗаписи, ТекущийОбъект.ИндексСтроки, "Редактирование", Ресурсы);
	Иначе
									
		Ресурсы = Новый Структура;
		Ресурсы.Вставить("КоличествоСтрок", НомерПоследнейЗаписи);		
		Ресурсы.Вставить("МаксИндексСтраницы", МаксИндексСтраницы);
		
		РегламентированнаяОтчетностьАЛКО.ДобавитьВРегистрЖурнала(ТекущийОбъект.Документ, ИмяРегистра,
									ИндексСтраницыЗаписи, 0, "Сервис", Ресурсы);							
	КонецЕсли;

	Если ВнесеныИзменения Тогда
		РегламентированнаяОтчетностьАЛКО.ПолучитьВнутреннееПредставлениеСтруктурыДанныхЗаписи(
											Запись, ИмяРегистра, КонечноеЗначениеСтруктураДанных);
	КонецЕсли;
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
    	МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
    	МодульУправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// Оповещаем о необходимости пересчета итогов форму-владелец для активных записей.
	Если ВнесеныИзменения и Запись.Активно Тогда
	 
		// Оповещаем форму-владелец о изменениях.
		ИнформацияДляПересчетаИтогов = Новый Структура;
		ИнформацияДляПересчетаИтогов.Вставить("ИмяРегистра", 		ИмяРегистра);
		ИнформацияДляПересчетаИтогов.Вставить("ИндексСтраницы", 	ИндексСтраницы);
		ИнформацияДляПересчетаИтогов.Вставить("ИндексСтроки", 		Запись.ИндексСтроки);
		ИнформацияДляПересчетаИтогов.Вставить("НачальноеЗначение", 	НачальноеЗначениеСтруктураДанных);
		ИнформацияДляПересчетаИтогов.Вставить("КонечноеЗначение", 	КонечноеЗначениеСтруктураДанных);
		
		Оповестить("ПересчетИтогов", ИнформацияДляПересчетаИтогов, УникальностьФормы);
	
	КонецЕсли;
	
	ВнесеныИзменения = Ложь;
		
КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если (НЕ ЗавершениеРаботы = Неопределено) и ЗавершениеРаботы Тогда
		// Идет завершение работы системы.
	Иначе
		// Обычное закрытие.
	    Если Элементы.ГруппаВыборПроизводителя.Видимость или Элементы.ГруппаВыборПоставщика.Видимость Тогда
		    // Щелкнули на крестик при выборе производителя.
			Отказ = Истина;
		    УправлениеВидимостью(Ложь, Ложь);
			
		КонецЕсли;	
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Источник = УникальностьФормы Тогда
		
		Если НРег(ИмяСобытия) = НРег("ЗакрытьОткрытыеФормыЗаписи") Тогда			
		    Модифицированность = Ложь;
			Закрыть();			
		КонецЕсли;
					
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура П000030000304ПриИзменении(Элемент)
	ТаблицаПроизводителейВыборНаСервере(Неопределено, Запись.П000030000304, "");
КонецПроцедуры

&НаКлиенте
Процедура П000030000308ПриИзменении(Элемент)
	
	СоответствиеТекущиеДанные = Новый Соответствие;
	СоответствиеТекущиеДанные.Вставить("НаименованиеПолное", Неопределено);
	СоответствиеТекущиеДанные.Вставить("ИНН", Запись.П000030000308);
	СоответствиеТекущиеДанные.Вставить("КПП", "");
	СоответствиеТекущиеДанные.Вставить("ДатаОкончания", Неопределено);
	СоответствиеТекущиеДанные.Вставить("СерияНомер", "");
	СоответствиеТекущиеДанные.Вставить("ВидДеятельности", "");
	
	ТаблицаПоставщиковВыборНаСервере(СоответствиеТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеНачалоВыбораИзОповещения(Элемент, СтандартнаяОбработка) Экспорт
	
	ПредставлениеНажатие(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ПредставлениеНажатие(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеНажатие(Элемент = Неопределено, СтандартнаяОбработка = Ложь)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элемент = Неопределено Тогда	
		Элемент = ТекущийЭлемент;	
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ВыборВидаПродукции();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеПриИзменении(Элемент)
	
	Если Элемент.Имя = "П000030000304" ИЛИ Элемент.Имя = "П000030000305" Тогда
	
		ОчищаемыйКонтрагент = "ПроизводительИмпортер";	
	
	КонецЕсли; 
	
	Если Элемент.Имя = "П000030000308" ИЛИ Элемент.Имя = "П000030000309" Тогда
	
		ОчищаемыйКонтрагент = "Поставщик";	
	
	КонецЕсли;
	
	ОбработкаПослеИзменения();
		
КонецПроцедуры


&НаКлиенте
Процедура ДокументПоступленияНажатие(Элемент, СтандартнаяОбработка)
	
	НажатиеГиперссылки(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры


&НаКлиенте
Процедура ПроизводительИмпортерПредставлениеНажатие(Элемент, СтандартнаяОбработка)
	
	НажатиеГиперссылки(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры


&НаКлиенте
Процедура ПоставщикПредставлениеНажатие(Элемент, СтандартнаяОбработка)
	
	НажатиеГиперссылки(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресНажатие(Элемент = Неопределено, СтандартнаяОбработка = Ложь) Экспорт
		
	СтандартнаяОбработка = Ложь;
	
	Если Элемент = Неопределено Тогда	
		Элемент = ТекущийЭлемент;	
	КонецЕсли;
	
	Если Элемент.Имя = "ПредставлениеАдресаПроизводителя" Тогда
	    ИмяПоля = "П000030000303Адрес";
	ИначеЕсли Элемент.Имя = "ПредставлениеАдресаПоставщика" Тогда	
	    ИмяПоля = "П000030000307";
	КонецЕсли;
	
	ВводАдресаНаКлиенте(ИмяПоля);
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаПроизводителей

&НаКлиенте
Процедура ТаблицаПроизводителейВыбор(Элемент, ВыбраннаяСтрока = Неопределено, Поле = Неопределено, СтандартнаяОбработка = Истина)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
	    Возврат;	
	КонецЕсли; 
	
	Производитель 		= Элемент.ТекущиеДанные.НаименованиеПолное;
	
	ПроизводительИНН	= Элемент.ТекущиеДанные.ИНН;
	ПроизводительКПП	= Элемент.ТекущиеДанные.КПП;	
	
	ТаблицаПроизводителейВыборНаСервере(Производитель, ПроизводительИНН, ПроизводительКПП);
			
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаПроизводителейПриАктивизацииСтроки(Элемент)
	
	Если НЕ ПроверялиНеобходимостьПоказаПредупреждения Тогда	
		
		Элементы.ГруппаИнфоВыбораПроизводителя.Видимость = (Элемент.ТекущиеДанные = Неопределено);			
		
		ПроверялиНеобходимостьПоказаПредупреждения = Истина;
		
	КонецЕсли;
	
	// Обход неверного отображения таблицы (укорачивание последнего столбца 
	// в таблицах с выводом значений по строке в нескольких уровнях).
	Если НЕ Элемент.ТекущиеДанные = Неопределено И НужноИсправитьВыводТаблицы Тогда			
		Элемент.Обновить();	
		НужноИсправитьВыводТаблицы = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаПоставщиков

&НаКлиенте
Процедура ТаблицаПоставщиковВыбор(Элемент, ВыбраннаяСтрока = Неопределено, Поле = Неопределено, СтандартнаяОбработка = Истина)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
	    Возврат;	
	КонецЕсли; 
	
	СоответствиеТекущиеДанные = Новый Соответствие;
	СоответствиеТекущиеДанные.Вставить("НаименованиеПолное", Элемент.ТекущиеДанные["НаименованиеПолное"]);
	СоответствиеТекущиеДанные.Вставить("ИНН", Элемент.ТекущиеДанные["ИНН"]);
	СоответствиеТекущиеДанные.Вставить("КПП", Элемент.ТекущиеДанные["КПП"]);
	СоответствиеТекущиеДанные.Вставить("ДатаОкончания", Элемент.ТекущиеДанные["ДатаОкончания"]);
	СоответствиеТекущиеДанные.Вставить("СерияНомер", Элемент.ТекущиеДанные["СерияНомер"]);
	СоответствиеТекущиеДанные.Вставить("ВидДеятельности", Элемент.ТекущиеДанные["ВидДеятельности"]);
		
	ТаблицаПоставщиковВыборНаСервере(СоответствиеТекущиеДанные);
			
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаПоставщиковПриАктивизацииСтроки(Элемент)
	
	Если НЕ ПроверялиНеобходимостьПоказаПредупреждения Тогда	
		
		Элементы.ГруппаИнфоВыбораПоставщика.Видимость = (Элемент.ТекущиеДанные = Неопределено);			
		
		ПроверялиНеобходимостьПоказаПредупреждения = Истина;
		
	КонецЕсли;
	
	// Обход неверного отображения таблицы (укорачивание последнего столбца 
	// в таблицах с выводом значений по строке в нескольких уровнях).
	Если НЕ Элемент.ТекущиеДанные = Неопределено И НужноИсправитьВыводТаблицы Тогда			
		Элемент.Обновить();	
		НужноИсправитьВыводТаблицы = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтменитьИЗакрыть(Команда)
	
	Модифицированность = Ложь;
	Закрыть();
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	Если НЕ Модифицированность Тогда
	    Закрыть();
	Иначе	
	    Записать();
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ВыбратьПроизводителяИмпортера(Команда)
	
	УправлениеВидимостью(Истина, Ложь);
	
КонецПроцедуры


&НаКлиенте
Процедура ВыбратьПоставщика(Команда)
	
	УправлениеВидимостью(Ложь, Истина);
	
КонецПроцедуры


&НаКлиенте
Процедура ВыборПроизводителя(Команда)
	
	ТаблицаПроизводителейВыбор(Элементы.ТаблицаПроизводителей);
	
КонецПроцедуры


&НаКлиенте
Процедура ВыборПоставщика(Команда)
	
	ТаблицаПоставщиковВыбор(Элементы.ТаблицаПоставщиков);
	
КонецПроцедуры


&НаКлиенте
Процедура ВернутьсяНазад(Команда)
	
	УправлениеВидимостью(Ложь, Ложь);
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ИнициализироватьUIФормы(НастройкаUI) Экспорт
	
	// Серверный вызов ради скорости исполнения, 
	// на клиенте намного медленнее из-за постоянного обновления формы.
	ИнициализироватьUIФормыНаСервере(НастройкаUI)

КонецПроцедуры

&НаСервере
Процедура ИнициализироватьUIФормыНаСервере(НастройкаUI) Экспорт

	РегламентированнаяОтчетностьАЛКОКлиентСервер.ИнициализироватьUIФормы(ЭтаФорма, НастройкаUI);

КонецПроцедуры


&НаСервере
Процедура ПодготовкаНаСервере()
	
	УправлениеВидимостью(Ложь, Ложь);
	
	ДоступностьПолейНаСервере();	
	СформироватьСпискиВыбораНаСервере();
	ФормированиеПредставленияПродукцииНаСервере();
	
	// Заполним начальное значение всех полей записи во внутреннем формате.
	ИмяРегистра = РегламентированнаяОтчетностьАЛКО.ПолучитьИмяОбъектаМетаданныхПоИмениФормы(ИмяФормы);
	
	Если ТекущееСостояниеВладельца = "Добавление" или ТекущееСостояниеВладельца = "Копирование" Тогда
		
		Запись.ИДДокИндСтраницы = РегламентированнаяОтчетностьАЛКО.ПолучитьИдДокИндСтраницы(Запись.Документ, ИндексСтраницыЗаписи);
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Запись.Документ, "Организация");
		Запись.Организация = ЗначенияРеквизитов.Организация;
		
		// Начальные данные в этих случаях всегда пустые.
		НачальноеЗначениеСтруктураДанных = РегламентированнаяОтчетностьАЛКО.ПолучитьСтруктуруДанныхЗаписиРегистраСведений(ИмяРегистра);
		НачальноеЗначение = ЗначениеВСтрокуВнутр(НачальноеЗначениеСтруктураДанных);
		
	Иначе
		НачальноеЗначение = РегламентированнаяОтчетностьАЛКО.ПолучитьВнутреннееПредставлениеСтруктурыДанныхЗаписи(
															Запись, ИмяРегистра, НачальноеЗначениеСтруктураДанных);
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ДоступностьПолейНаСервере()

	// Доступность полей формы в зависимости от флажка Авторасчет в отчете-владельце.
	// Для раздела 2 Алко приложения 11 нет авторасчета.
	
	Возврат;
	
КонецПроцедуры


&НаСервере
Функция ОбъектОтчета(ИмяФормыОбъекта)
	
	Возврат РегламентированнаяОтчетностьАЛКО.ОбъектОтчетаАЛКО(ИмяФормыОбъекта, ОбъектЭтогоОтчета);
	
КонецФункции


&НаСервере
Процедура ОбработкаМодифицированности(НачальноеЗначениеПолей, СтруктураМодифицированности)
	
	МодифицированностьКлючевыхПолей = Ложь;
	Для Каждого ЭлСтруктуры Из СтруктураМодифицированности Цикл
					
		Если ЭлСтруктуры.Значение Тогда
		    МодифицированностьКлючевыхПолей = Истина;
			Прервать;			
		КонецЕсли; 
	
	КонецЦикла;
			
	Если НЕ МодифицированностьКлючевыхПолей Тогда
		
		// Принудительно записываем начальные данные, включая всю
		// вспомогательную информацию.
		ЗаполнитьЗначенияСвойств(Запись, НачальноеЗначениеПолей);
		
	Иначе
		
		// Что то изменилось, значит уже не по документу.
		Запись.ДокументДвижения = Неопределено;
		
		Если ЗначениеЗаполнено(ОчищаемыйКонтрагент) Тогда		
			Запись[ОчищаемыйКонтрагент] = Неопределено;			
		КонецЕсли;
		ОчищаемыйКонтрагент = "";
		
		ОбъектОтчета(ИмяФормыВладельца).ОбработкаЗаписи(ИмяРегистра, Запись, , ДатаПериодаОтчета);		
		
	КонецЕсли; 
	
	ФормированиеПредставленияПродукцииНаСервере();
		
	Модифицированность = МодифицированностьКлючевыхПолей;
	
КонецПроцедуры


&НаСервере
Процедура ОбработкаПослеИзменения()
	
	СтруктураМодифицированности = "";
	РегламентированнаяОтчетностьАЛКО.ЗаписьИзменилась(Запись, НачальноеЗначениеСтруктураДанных, 
														Ложь, СтруктураМодифицированности);
	ОбработкаМодифицированности(НачальноеЗначениеСтруктураДанных, СтруктураМодифицированности);
	
	ФормированиеЗаголовковСвернутогоОтображения();
	
КонецПроцедуры

&НаСервере
Процедура ФормированиеЗаголовковСвернутогоОтображения()
	
	Элементы.ДокументДвижения.Видимость = ЗначениеЗаполнено(Запись.ДокументДвижения);
	
	// ГруппаПроизводительИмпортер.
	Элементы.ПроизводительИмпортерПредставление.Видимость = ЗначениеЗаполнено(Запись.ПроизводительИмпортер);
	
	// Доступ к КПП только если введен 10 значный ИНН.
	Если СтрДлина(СокрЛП(Запись.П000030000304)) = 10 Тогда
	    Элементы.П000030000305.ТолькоПросмотр = Ложь;
		Элементы.П000030000305.ПропускатьПриВводе = Ложь;
	Иначе
		
	    Элементы.П000030000305.ТолькоПросмотр = Истина;
		Элементы.П000030000305.ПропускатьПриВводе = Истина;
		Если НЕ СокрЛП(Запись.П000030000305) = "" Тогда
		    Запись.П000030000305 = "";
			Модифицированность = Истина;		
		КонецЕсли; 
		
	КонецЕсли; 
	
	// ГруппаПоставщика.
	Элементы.ПоставщикПредставление.Видимость = ЗначениеЗаполнено(Запись.Поставщик);
						
	// Доступ к КПП только если введен 10 значный ИНН.
	Если СтрДлина(СокрЛП(Запись.П000030000308)) = 10 Тогда
		
	    Элементы.П000030000309.ТолькоПросмотр = Ложь;
		Элементы.П000030000309.ПропускатьПриВводе = Ложь;
		
	Иначе
		
	    Элементы.П000030000309.ТолькоПросмотр = Истина;
		Элементы.П000030000309.ПропускатьПриВводе = Истина;
		Если НЕ СокрЛП(Запись.П000030000309) = "" Тогда
		    Запись.П000030000309 = "";
			Модифицированность = Истина;		
		КонецЕсли; 
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ФормированиеПредставленияПродукцииНаСервере(
						ВидПродукции = Неопределено, КодВида = Неопределено, 
						АдресПроизводителя = Неопределено, АдресПоставщика = Неопределено)
	
	Если ВидПродукции = Неопределено Тогда
	    ВидПродукции = Запись.П000030000301;	
	КонецЕсли;
	
	Если КодВида = Неопределено Тогда
	    КодВида = Запись.П000030000302;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КодВида) Тогда
	    ПредставлениеПродукции = "Код " + КодВида + ", " + ВидПродукции;
	Иначе	
	    ПредставлениеПродукции = "";
	КонецЕсли; 
	
	// Адрес производителя.
	Если АдресПроизводителя = Неопределено Тогда
	    АдресПроизводителя = Запись.П000030000303Адрес;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресПроизводителя) Тогда
	    ПредставлениеАдресаПроизводителя = АдресПроизводителя;
	Иначе	
	    ПредставлениеАдресаПроизводителя = "Заполнить";
	КонецЕсли;
	
	Если ПредставлениеАдресаПроизводителя = "Заполнить" Тогда		
		Элементы.ПредставлениеАдресаПроизводителя.ЦветТекста = ЦветСтиляНезаполненныйРеквизит;
	Иначе
		Элементы.ПредставлениеАдресаПроизводителя.ЦветТекста = ЦветСтиляЦветГиперссылкиБРО;
	КонецЕсли;
	
	// Адрес поставщика.
	Если АдресПоставщика = Неопределено Тогда
	    АдресПоставщика = Запись.П000030000307;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресПоставщика) Тогда
	    ПредставлениеАдресаПоставщика = АдресПоставщика;
	Иначе	
	    ПредставлениеАдресаПоставщика = "Заполнить";
	КонецЕсли;
	
	Если ПредставлениеАдресаПоставщика = "Заполнить" Тогда		
		Элементы.ПредставлениеАдресаПоставщика.ЦветТекста = ЦветСтиляНезаполненныйРеквизит;
	Иначе
		Элементы.ПредставлениеАдресаПоставщика.ЦветТекста = ЦветСтиляЦветГиперссылкиБРО;
	КонецЕсли;
		
	ФормированиеЗаголовковСвернутогоОтображения();
		
КонецПроцедуры

&НаКлиенте
Процедура ВводАдресаНаКлиенте(ИмяПоля)
	
	СтандартнаяОбработка = Ложь;
		
	ЗаголовокФормыВвода = "Ввод адреса";
	ВидКонтактнойИнформации = УправляемаяФормаВладелец.СтруктураРеквизитовФормы.СправочникиВидыКонтактнойИнформации.ЛюбойАдрес;
		
	Оповещение = Новый ОписаниеОповещения("ВводАдресаЗавершениеНаКлиенте", ЭтаФорма, ИмяПоля);
	
	РегламентированнаяОтчетностьАЛКОКлиент.ВызватьФормуВводаАдресаКонтрагента(
					Запись[ИмяПоля + "XML"], ЗаголовокФормыВвода, Оповещение, ВидКонтактнойИнформации);
		
КонецПроцедуры
				
&НаКлиенте
Процедура ВводАдресаЗавершениеНаКлиенте(Результат, ИмяПоля) Экспорт

	Если НЕ (ТипЗнч(Результат) = Тип("Структура")) Тогда
		Возврат;	
	КонецЕсли;
	
	РегламентированнаяОтчетностьАЛКОКлиент.ВводАдресаКонтрагентаЗавершениеНаКлиенте(Результат, 
				Запись[ИмяПоля], Запись[ИмяПоля + "XML"], Модифицированность);
		
	ОбработкаПослеИзменения();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборВидаПродукции()
	
	// Из списка.
	ИсходноеЗначениеКода = СокрЛП(Запись.П000030000302);
	ИсходноеЗначениеНазвания = СокрЛП(Запись.П000030000301);
	КолонкаПоиска = "Код";
	ИмяКолонкиКодПродукции = "П000030000302";
		
	// Не из списка.
	ЗаголовокФормы = "Ввод вида продукции";
	НадписьПоляЗначения = "Вид продукции";
	НадписьПоляКод = "Код";
	МногострочныйРежимЗначения = Истина;
	ДлинаПоляКода  = 4;
	ДлинаПоляЗначения = 40;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборЗавершение", ЭтотОбъект);
		
	СтруктураПараметров = Новый Структура;
	
	СтруктураПараметров.Вставить("ПараметрыПриВключенномВыбореИзСписка", Новый Структура);
	ПараметрыВыборИзСписка = СтруктураПараметров.ПараметрыПриВключенномВыбореИзСписка;
	// Из списка.
	ПараметрыВыборИзСписка.Вставить("СвойстваПоказателей", 	СвойстваПоказателей);
	ПараметрыВыборИзСписка.Вставить("ИмяКолонкиКод", 		ИмяКолонкиКодПродукции);	
	ПараметрыВыборИзСписка.Вставить("КолонкаПоиска", 		КолонкаПоиска);
	ПараметрыВыборИзСписка.Вставить("ИсходноеЗначение", 	ИсходноеЗначениеКода);
	
	СтруктураПараметров.Вставить("ПараметрыПриОтключенномВыбореИзСписка", Новый Структура);
	ПараметрыВыборНеИзСписка = СтруктураПараметров.ПараметрыПриОтключенномВыбореИзСписка;
	// Не из списка.
	ПараметрыВыборНеИзСписка.Вставить("ЗаголовокФормы", 			ЗаголовокФормы);
	ПараметрыВыборНеИзСписка.Вставить("ИсходноеЗначениеКода", 		ИсходноеЗначениеКода);	
	ПараметрыВыборНеИзСписка.Вставить("ИсходноеЗначениеПоКоду",		ИсходноеЗначениеНазвания);
	ПараметрыВыборНеИзСписка.Вставить("НадписьПоляЗначения", 		НадписьПоляЗначения);
	ПараметрыВыборНеИзСписка.Вставить("НадписьПоляКод", 			НадписьПоляКод);
	ПараметрыВыборНеИзСписка.Вставить("МногострочныйРежимЗначения", МногострочныйРежимЗначения);
	ПараметрыВыборНеИзСписка.Вставить("ДлинаПоляКода", 				ДлинаПоляКода);
	ПараметрыВыборНеИзСписка.Вставить("ДлинаПоляЗначения", 			ДлинаПоляЗначения);
	ПараметрыВыборНеИзСписка.Вставить("УникальностьФормы", 			УникальностьФормы);

	
	РегламентированнаяОтчетностьАЛКОКлиент.ВызватьФормуВыбораЗначенийАЛКО(
			ЭтаФорма, ФлажокОтклАвтоВыборКодов, СтруктураПараметров, ОписаниеОповещения);
		
КонецПроцедуры


&НаКлиенте
Процедура ВыборЗавершение(РезультатВыбора, Параметры) Экспорт
	
	ОткрытаяФормаПотомокСБлокировкойВладельца = Неопределено;
	
	Если РезультатВыбора = Неопределено Тогда
	    Возврат;	
	КонецЕсли; 
	
	// Поскольку всегда "выбираем" код.
	ИмяКолонкиКодПродукции 			= "П000030000302";
	ИмяКолонкиНаименованияПродукции = "П000030000301";
	
	ИсходноеЗначение 				= СокрЛП(Запись[ИмяКолонкиКодПродукции]);
	Запись[ИмяКолонкиКодПродукции] 	= СокрЛП(РезультатВыбора.Код);
	
	КодИзменился = (ИсходноеЗначение <> СокрЛП(Запись[ИмяКолонкиКодПродукции]));
		
	ИсходноеЗначениеНаименования 			= СокрЛП(Строка(Запись[ИмяКолонкиНаименованияПродукции]));
	Запись[ИмяКолонкиНаименованияПродукции] = ?(СокрЛП(РезультатВыбора.Код) = "",
													"", СокрЛП(РезультатВыбора.Название));
	
	НаименованиеИзменилось = (ИсходноеЗначениеНаименования <> СокрЛП(Запись[ИмяКолонкиНаименованияПродукции]));	
	
	Модифицированность = Модифицированность или КодИзменился или НаименованиеИзменилось;
			
	ОбработкаПослеИзменения(); 
	
КонецПроцедуры


&НаСервере
Процедура СформироватьСпискиВыбораНаСервере()
	
	КоллекцияСписковВыбора = РегламентированнаяОтчетностьАЛКО.СчитатьКоллекциюСписковВыбораАЛКО(
														ДатаПериодаОтчета, ИмяФормыВладельца, ОбъектЭтогоОтчета);
	
	СвойстваПоказателей.Очистить();
	
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "П000030000301", 3, , "Выбор вида продукции", КоллекцияСписковВыбора["ВидыПродукции"]);
	РегламентированнаяОтчетность.ДобавитьСтрокуОписанияВвода(СвойстваПоказателей, "П000030000302", 3, , "Выбор вида продукции", КоллекцияСписковВыбора["ВидыПродукции"]);
	
	МассивВидовДеятельностиПоЛицензии = КоллекцияСписковВыбора["ВидыДеятельностиЛицензионные"].ВыгрузитьКолонку("Название");
	Элементы.П000030000310.СписокВыбора.ЗагрузитьЗначения(МассивВидовДеятельностиПоЛицензии);
	
КонецПроцедуры


&НаСервере
Процедура УправлениеВидимостью(ПоказатьВыборПроизводителей = Ложь, ПоказатьВыборПоставщиков = Ложь)
	
	Если ПоказатьВыборПроизводителей Тогда
		
		НужноИсправитьВыводТаблицы = Истина;
		
		ПроверялиНеобходимостьПоказаПредупреждения = Ложь;
		
		Если ВставитьКодПродукции Тогда
		    ДинСписокПроизводителяИмпортера.Параметры.УстановитьЗначениеПараметра("КодПродукции", Запись.П000030000302);		
		КонецЕсли; 
				
		Элементы.ОК.Видимость = Ложь;
		
		Элементы.ГруппаЗапись.Видимость = Ложь;
		Элементы.ГруппаВыборПоставщика.Видимость = Ложь;
		
		Элементы.ГруппаВыборПроизводителя.Видимость = Истина;
		
		Если ЗначениеЗаполнено(Запись.ПроизводительИмпортер) Тогда
		
			Элементы.ТаблицаПроизводителей.ТекущаяСтрока = Запись.ПроизводительИмпортер;
		
		КонецЕсли; 
						
	ИначеЕсли ПоказатьВыборПоставщиков Тогда
		
		НужноИсправитьВыводТаблицы = Истина;
		
		ПроверялиНеобходимостьПоказаПредупреждения = Ложь;
		
		Если ВставитьКодПродукцииПоставщик Тогда	
			ДинСписокПоставщика.Параметры.УстановитьЗначениеПараметра("КодПродукции", Запись.П000030000302);			
		КонецЕсли;
		
		Если СтрНайти(ДинСписокПоставщика.ТекстЗапроса, "&ДатаКонца") > 0 Тогда
			
			ДинСписокПоставщика.Параметры.УстановитьЗначениеПараметра("ДатаНачала", ДатаНачалаОтчета);
			ДинСписокПоставщика.Параметры.УстановитьЗначениеПараметра("ДатаКонца", ДатаПериодаОтчета);
			
		КонецЕсли;
				
		Элементы.ОК.Видимость = Ложь;
		
		Элементы.ГруппаЗапись.Видимость = Ложь;
		Элементы.ГруппаВыборПроизводителя.Видимость = Ложь;
		
		Элементы.ГруппаВыборПоставщика.Видимость = Истина;
		
		Если ЗначениеЗаполнено(Запись.Поставщик) Тогда
																				
			Если НЕ ДинСписокПоставщика.ОсновнаяТаблица = "Справочник.Контрагенты" Тогда
								
				ОсновнаяТаблица = "";
				
				СтруктураПараметров = Новый Структура;
				СтруктураПараметров.Вставить("КодПродукции", Истина);
				СтруктураПараметров.Вставить("ВставитьКодПродукции", ВставитьКодПродукцииПоставщик);
				СтруктураПараметров.Вставить("ВставитьДату", ВставитьДату);
	
				ТекстЗапроса = РегламентированнаяОтчетностьАЛКО.ТекстЗапросаВыбораКонтрагентаАЛКО(
										ОсновнаяТаблица, Истина, , Истина, СтруктураПараметров);
				ЗапросВидаЛицензии = Новый Запрос;
				ЗапросВидаЛицензии.Текст = ТекстЗапроса;
				
				ЗапросВидаЛицензии.Параметры.Вставить("ИскомыйКонтрагентСсылка", Запись.Поставщик);
				
				Если ВставитьКодПродукцииПоставщик Тогда	
					ЗапросВидаЛицензии.Параметры.Вставить("КодПродукции", Запись.П000030000302);					
				КонецЕсли;
				
				Если СтрНайти(ТекстЗапроса, "&ДатаКонца") > 0 Тогда
					
					ЗапросВидаЛицензии.Параметры.Вставить("ДатаНачала", ДатаНачалаОтчета);
					ЗапросВидаЛицензии.Параметры.Вставить("ДатаКонца", ДатаПериодаОтчета);
					
				КонецЕсли;
		
				Результат = ЗапросВидаЛицензии.Выполнить().Выгрузить();
				
				// Выбор из регистра сведений лицензии поставщиков.
				СтрокаРегистрСведенийЛицензииПоставщиковАлкогольнойПродукции = ДинСписокПоставщика.ОсновнаяТаблица;
				
				ИзмерениеПоставщик = "";
				
				Если СтрНайти(ВРег(СтрокаРегистрСведенийЛицензииПоставщиковАлкогольнойПродукции), 
								  ВРег("РегистрСведений.")) > 0 Тогда
					ИзмерениеПоставщик 	= "Поставщик";
					
				ИначеЕсли СтрНайти(ВРег(СтрокаРегистрСведенийЛицензииПоставщиковАлкогольнойПродукции), 
								  ВРег("Справочник.")) > 0 Тогда
					ИзмерениеПоставщик 	= "Владелец";
					
				КонецЕсли;
	 
				КолСтрокРезультата = Результат.Количество();
				ВидЛицензии = Неопределено;
				КодВидаПродукции = Неопределено;
				ДатаНачала  = Неопределено;
				СсылкаНаЭлемент	= Неопределено;
				
				Если КолСтрокРезультата > 0 Тогда
					
					// Зафиксируем первую подходящую запись.
					// Даже если не найдем полное совпадение - спозиционируем на первой
					// более менее подходящей строке.
					
					ВидЛицензии = Результат[0].ВидЛицензии;
					ДатаНачала =  Результат[0].ДатаВыдачи;
					КодВидаПродукции = Результат[0].КодВидаПродукции;
					
					Если ИзмерениеПоставщик = "Владелец" Тогда
					
						СсылкаНаЭлемент =  Результат[0].Ссылка;
					
					КонецЕсли; 
					
					Если КолСтрокРезультата > 1 Тогда
						
						// Найдем по соответствию серии-номера. Количество строк перебора не может быть большим.
						Для Инд = 0 По КолСтрокРезультата - 1 Цикл
						
							ТекСтрокаРезультата = Результат[Инд];
							ТекСерияНомер 		= ТекСтрокаРезультата.СерияНомер;
							ТекДатаНачала 		= ТекСтрокаРезультата.ДатаВыдачи;
							ТекДатаОкончания 	= ТекСтрокаРезультата.ДатаОкончания;
							ТекВидДеятельности  = ТекСтрокаРезультата.ВидДеятельности;
							ТекКодВидаПродукции = ТекСтрокаРезультата.КодВидаПродукции;
							
							Если (СокрЛП(ТекСерияНомер) = СокрЛП(Запись.СерияНомер))
								И (ТекДатаОкончания = Запись.ДатаОкончания) Тогда
								
								// Нашли что искали.
								ВидЛицензии = ТекСтрокаРезультата.ВидЛицензии;
							    ДатаНачала  = ТекДатаНачала;
								КодВидаПродукции = ТекКодВидаПродукции;
								
								Если ИзмерениеПоставщик = "Владелец" Тогда					
									СсылкаНаЭлемент =  ТекСтрокаРезультата.Ссылка;								
								КонецЕсли;
					
								Прервать;
							
							КонецЕсли; 
						
						КонецЦикла;
						
					КонецЕсли;
					
				КонецЕсли;
				
				Если (НЕ ВидЛицензии = Неопределено) 
					И (НЕ ДатаНачала = Неопределено)
					И (НЕ КодВидаПродукции = Неопределено) Тогда
					
					Если ИзмерениеПоставщик = "Поставщик" Тогда
								  
						Отбор = Новый Структура;
						Отбор.Вставить("Поставщик", Запись.Поставщик);
						Отбор.Вставить("КодВидаПродукции", КодВидаПродукции);
						Отбор.Вставить("ВидЛицензии", ВидЛицензии);
						Отбор.Вставить("Период", ДатаНачала);
											
						ИмяРегистраСведенийЛицензииПоставщиковАлкогольнойПродукции = 
							СтрЗаменить(ВРег(СтрокаРегистрСведенийЛицензииПоставщиковАлкогольнойПродукции), 
								  		ВРег("РегистрСведений."), "");
						РегистрСведенийЛицензий = РегистрыСведений[ИмяРегистраСведенийЛицензииПоставщиковАлкогольнойПродукции];
						
						КлючЗаписи = РегистрСведенийЛицензий.СоздатьКлючЗаписи(Отбор);
				 
					Иначе						
						КлючЗаписи = СсылкаНаЭлемент;
					КонецЕсли;
					
					Элементы.ТаблицаПоставщиков.ТекущаяСтрока = КлючЗаписи;
						
				КонецЕсли; 
					
			Иначе
				
				Элементы.ТаблицаПоставщиков.ТекущаяСтрока = Запись.Поставщик;
				
			КонецЕсли;
							
		КонецЕсли;
				
	Иначе
				
		Элементы.ГруппаИнфоВыбораПроизводителя.Видимость = Ложь;
		Элементы.ГруппаИнфоВыбораПоставщика.Видимость = Ложь;
		
		Элементы.ГруппаВыборПоставщика.Видимость = Ложь;
		Элементы.ГруппаВыборПроизводителя.Видимость = Ложь;
		
		Элементы.ГруппаЗапись.Видимость = Истина;	
		
		Элементы.ОК.Видимость = Истина;
		
	КонецЕсли; 
	
КонецПроцедуры


&НаСервере
Функция ПолучитьИмяФормыОбъектаЭлементаСсылки(ИмяЭлементаСсылки, ЗначениеСсылка = Неопределено)
	
	ЗначениеСсылка = РегламентированнаяОтчетностьАЛКО.ПолучитьЗначениеЭлементаФормы(ЭтаФорма, ИмяЭлементаСсылки);	
	ИмяФормыОбъекта = РегламентированнаяОтчетностьАЛКО.ПолучитьИмяФормыОбъекта(ЗначениеСсылка);
	
	Возврат ИмяФормыОбъекта;
	
КонецФункции


&НаКлиенте
Процедура НажатиеГиперссылки(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	ИмяЭлементаСсылки = Элемент.Имя;
	
	ЗначениеСсылка = Неопределено;
	ИмяФормыОбъекта = ПолучитьИмяФормыОбъектаЭлементаСсылки(ИмяЭлементаСсылки, ЗначениеСсылка);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("НажатиеГиперссылкиЗавершение", ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", ЗначениеСсылка);
	ОткрытаяФормаПотомокСБлокировкойВладельца = ОткрытьФорму(ИмяФормыОбъекта, ПараметрыФормы, 
			ЭтаФорма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры


&НаКлиенте
Процедура НажатиеГиперссылкиЗавершение(Результат, ДопПараметры) Экспорт
	
	ОткрытаяФормаПотомокСБлокировкойВладельца = Неопределено;
	
	Если ПоказыватьПредупреждениеПослеПереходаПоссылке = Неопределено Тогда
	    ПоказыватьПредупреждениеПослеПереходаПоссылке = Истина;	
	КонецЕсли;
	
	Если ПоказыватьПредупреждениеПослеПереходаПоссылке Тогда
	    // Открываем форму предупреждения.
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Заголовок", НСтр("ru='Внимание!'"));
		ПараметрыФормы.Вставить("ТекстПредупреждения", НСтр("ru='"
				+ "Если Вы внесли изменения в элемент справочника или документ,
				|для внесения изменений в строки отчета, заполняемых на основании
				|измененной информации, необходимо вручную перезаполнить такие строки.'"));
		
		ПараметрыФормы.Вставить("ТекстЗаголовкаФлажка", НСтр("ru='Больше не показывать в этом сеансе редактирования'"));
		ПараметрыФормы.Вставить("УникальностьФормы",       		УникальностьФормы);
		
		ИмяФормыПредупреждения = "ОбщаяФорма.АЛКОФормаПредупрежденияСФлажком";
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьСостояниеФлажкаФормыПредупреждения", ЭтотОбъект);
		ОткрытьФорму(ИмяФормыПредупреждения, ПараметрыФормы, ЭтаФорма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли; 
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработатьСостояниеФлажкаФормыПредупреждения(Результат, ДопПараметры) Экспорт
	
	Если (НЕ Результат = Неопределено) и Результат Тогда
		// Оповещаем форму отчета владельца о том, что больше показывать
		// предупреждение не надо.
		ПоказыватьПредупреждениеПослеПереходаПоссылке = Ложь;
		Оповестить("ПоказыватьПредупреждениеПослеПереходаПоСсылке", , УникальностьФормы);
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ТаблицаПроизводителейВыборНаСервере(Производитель, ПроизводительИНН, ПроизводительКПП)
	
	Если НЕ (Запись.П000030000304 = СокрЛП(ПроизводительИНН)
		И Запись.П000030000305 = СокрЛП(ПроизводительКПП)
		И Запись.П000030000303 = СокрЛП(Производитель)) Тогда
	
		Запись.П000030000303Адрес = "";
		Запись.П000030000303АдресXML = "";
				
	КонецЕсли;
	
	Запись.П000030000304 = СокрЛП(ПроизводительИНН);
	Запись.П000030000305 = СокрЛП(ПроизводительКПП);
	Запись.П000030000303 = СокрЛП(Производитель);
	
	УправлениеВидимостью(Ложь, Ложь);
	
	ОчищаемыйКонтрагент = "ПроизводительИмпортер";
	
	ОбработкаПослеИзменения();
	
КонецПроцедуры


&НаСервере
Процедура ТаблицаПоставщиковВыборНаСервере(СоответствиеТекущиеДанные)
	
	НаименованиеПолное = СоответствиеТекущиеДанные.Получить("НаименованиеПолное");
	ИНН = СоответствиеТекущиеДанные.Получить("ИНН");
	КПП = СоответствиеТекущиеДанные.Получить("КПП");
	ДатаОкончания = СоответствиеТекущиеДанные.Получить("ДатаОкончания");
	СерияНомер = СоответствиеТекущиеДанные.Получить("СерияНомер");
	ВидДеятельности = СоответствиеТекущиеДанные.Получить("ВидДеятельности");
	
	Если НЕ (Запись.П000030000308 = СокрЛП(ИНН)
		И Запись.П000030000309 = СокрЛП(КПП)
		И Запись.П000030000306 = СокрЛП(НаименованиеПолное)) Тогда
	
		Запись.П000030000307 = "";
		Запись.П000030000307XML = "";
				
	КонецЕсли;
			
	Запись.П000030000308 = СокрЛП(ИНН);
	Запись.П000030000309 = СокрЛП(КПП);	
	Запись.П000030000306 = СокрЛП(НаименованиеПолное);
	
	Запись.П000030000310 = СокрЛП(ВидДеятельности);
	
	Запись.ДатаОкончания = ДатаОкончания;
	Запись.СерияНомер = СокрЛП(СерияНомер);
	
	УправлениеВидимостью(Ложь, Ложь);
	
	ОчищаемыйКонтрагент = "Поставщик";
	
	ОбработкаПослеИзменения();
	
КонецПроцедуры

#КонецОбласти
